CSI API ETABS v1
cDStCanadian_S16_19.GetPreference Method
 Retrieves the value of a steel design preference item
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDStCanadian_S16_19
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 22, inclusive, indicating the preference item considered
Multi-response case design
Framing type
Spectral Acceleration Ratio, Ie*Fa*Sa(0.2)
Ductility related modification factor, Rd
Overstrength related modification factor, Ro
Capacity factor, Phi bending
Capacity factor, Phi compression
Capacity factor, Phi tension
Capacity factor, Phi shear
Slender section modification
Ignore seismic code
Ignore special seismic load
Doubler plate is plug welded
Consider deflection
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total camber limit, L/Value
Pattern live load factor
Demand/capacity ratio limit
Seismic Design Category
Value
Type: System.Double
 The value of the considered preference item
Multi-response case design
1 - Envelopes
2 - Step-by-step
3 - Last step
4 - Envelopes -- All
5 - Step-by-step -- All
Framing type
1 - Type LD MRF
2 - Type MD MRF
3 - Type D MRF
4 - Type LD CBF(V)
5 - Type LD CBF(TC)
6 - Type LD CBF(TO)
7 - Type LD CBF(OT)
8 - Type MD CBF(V)
9 - Type MD CBF(TC)
10 - Type MD CBF(TO)
11 - Type MD CBF(OT)
12 - EBF
13 - Cantilever Column
14 - Conventional MF
15 - Conventional BF
Spectral Acceleration Ratio, Ie*Fa*Sa(0.2)
Value > 0
Ductility related modification factor, Rd
Value > 0
Overstrength related modification factor, Ro
Value > 0
Capacity factor, Phi bending
Value > 0
Capacity factor, Phi compression
Value > 0
Capacity factor, Phi tension
Value > 0
Capacity factor, Phi shear
Value > 0
Slender section modification
1 - modified geometry
2 - modified Fy
Ignore seismic code
0 = No
Any other value = Yes
Ignore special seismic load
0 = No
Any other value = Yes
Doubler plate is plug welded
0 = No
Any other value = Yes
Consider deflection
0 = No
Any other value = Yes
DL deflection limit, L/Value
Value > 0
SDL + LL deflection limit, L/Value
Value > 0
LL deflection limit, L/Value
Value > 0
Total deflection limit, L/Value
Value > 0
Total camber limit, L/Value
Value > 0
Pattern live load factor
Value >= 0
Demand/capacity ratio limit
Value > 0
Seismic Design Category
1 - SC0
2 - SC1
3 - SC2
4 - SC3
5 - SC4
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise, it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("CSA S16-19")
'get preference item
   ret = SapModel.DesignSteel.Canadian_S16_19.GetPreference(4, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStCanadian_S16_19 Interface
ETABSv1 Namespace